Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0280] The target base station determines, based on a load capability, whether the terminal can access the target base station.
de_de: [0280] Die Zielbasisstation bestimmt basierend auf einer Lastfähigkeit, ob das Endgerät auf die Zielbasisstation zugreifen kann.

source: [0281] In one case, if the target base station has relatively heavy load and cannot be accessed by the terminal, the target base station may reject the resume request of the terminal, that is, reject access by the terminal to the target base station.
de_de: [0281] In einem Fall, wenn die Zielbasisstation eine relativ hohe Last aufweist und auf die das Endgerät nicht zugreifen kann, kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts zurückweisen, das heißt, den Zugriff des Endgeräts auf die Zielbasisstation zurückweisen.

source: In this case, step 604 to step 607 are performed.
de_de: In diesem Fall werden Schritt 604 bis Schritt 607 durchgeführt.

source: [0282] In another case, the target base station does not have very heavy load and may further be accessed by the terminal. In this case, the target base station may accept the resume request of the terminal, that is, agree to access by the terminal to the target base station.
de_de: [0282] In einem anderen Fall weist die Zielbasisstation keine sehr hohe Last auf und es kann ferner durch das Endgerät darauf zugegriffen werden. In diesem Fall kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts akzeptieren, das heißt, dem Zugriff durch das Endgerät auf die Zielbasisstation zustimmen.

source: In this case, step 608 to step 611 are performed.
de_de: In diesem Fall werden die Schritte 608 bis 611 durchgeführt.

source: [0283] Step 604: The target base station sends a notification message to the source base station, and the source base station receives the notification message from the target base station.
de_de: [0283] Schritt 604: Die Zielbasisstation sendet eine Benachrichtigungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Benachrichtigungsnachricht von der Zielbasisstation.

source: [0284] The notification message includes the message authentication code and the resume identifier that are obtained by the target base station from the connection resume request message.
de_de: [0284] Die Benachrichtigungsnachricht enthält den Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung, die durch die Zielbasisstation aus der Verbindungswiederaufnahmeanforderungsnachricht erhalten werden.

source: Optionally, the notification message may further include the indication parameter.
de_de: Optional kann die Benachrichtigungsnachricht ferner den Anzeigeparameter enthalten.

source: [0285] The notification message has one or more of the following functions:
de_de: [0285] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: [0286] The key may be an access stratum key and/or an integrity protection key.
de_de: [0286] Der Schlüssel kann ein Zugriffsschichtschlüssel und/oder ein Integritätsschutzschlüssel sein.

source: [0287] Step 605: The source base station checks the message authentication code, and updates the freshness parameter and the key that are in the context of the terminal if checking the message authentication code to be successful.
de_de: [0287] Schritt 605: Die Quellbasisstation prüft den Nachrichtenauthentifizierungscode und aktualisiert den Aktualitätsparameter und den Schlüssel, die sich im Kontext des Endgeräts befinden, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0288] In this step, the source base station first determines the context of the terminal in the source base station based on the resume identifier in the notification message.
de_de: [0288] In diesem Schritt bestimmt die Quellbasisstation zunächst den Kontext des Endgeräts in der Quellbasisstation basierend auf der Wiederaufnahmekennung in der Benachrichtigungsnachricht.

source: [0289] Then, the source base station determines the freshness parameter.
de_de: [0289] Dann bestimmt die Quellbasisstation den Aktualitätsparameter.

source: The source base station may determine the freshness parameter based on the indication parameter in the notification message.
de_de: Die Quellbasisstation kann den Aktualitätsparameter basierend auf dem Anzeigeparameter in der Benachrichtigungsnachricht bestimmen.

source: For example, when the freshness parameter is a PDCP count, the source base station determines, based on the indication parameter, a PDCP count indicated by the indication parameter.
de_de: Wenn der Aktualitätsparameter beispielsweise eine PDCP-Zählung ist, bestimmt die Quellbasisstation basierend auf dem Anzeigeparameter eine PDCP-Zählung, die durch den Anzeigeparameter angezeigt wird.

source: The source base station may alternatively directly determine the freshness parameter.
de_de: Die Quellbasisstation kann alternativ den Aktualitätsparameter direkt bestimmen.

source: For example, when the freshness parameter is a quantity of rejection times, the source base station determines a current quantity of rejection times as the quantity of rejection times.
de_de: Wenn der Aktualitätsparameter zum Beispiel eine Anzahl von Ablehnungszeiten ist, bestimmt die Quellbasisstation eine aktuelle Anzahl von Ablehnungszeiten als die Anzahl von Ablehnungszeiten.

source: [0290] Then, the source base station generates the message authentication code based on the freshness parameter, the integrity protection key of the source base station, and the integrity protection algorithm of the source base station.
de_de: [0290] Dann erzeugt die Quellbasisstation den Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter, dem Integritätsschutzschlüssel der Quellbasisstation und dem Integritätsschutzalgorithmus der Quellbasisstation.

source: [0291] The source base station updates the freshness parameter in the context of the terminal based on the freshness parameter if checking the message authentication code to be successful.
de_de: [0291] Die Quellbasisstation aktualisiert den Aktualitätsparameter in dem Kontext des Endgeräts basierend auf dem Aktualitätsparameter, wenn überprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: For details, refer to the related description of step 405.
de_de: Für Einzelheiten wird auf die zugehörige Beschreibung von Schritt 405 verwiesen.

source: In addition, the source base station further updates the key in the context of the terminal. For example, the integrity protection key Krrc-int in the source base station is updated to Krrc-int*, and/or the access stratum key KgNB in the source base station is updated to KgNB*.
de_de: Zusätzlich aktualisiert die Quellbasisstation den Schlüssel im Kontext des Endgeräts. Zum Beispiel wird der Integritätsschutzschlüssel Krrc-int in der Quellbasisstation auf Krrc-int* aktualisiert, und/oder der Zugriffsschichtschlüssel KgNB in der Quellbasisstation wird auf KgNB* aktualisiert.

source: [0292] Step 606: The source base station sends a response message to the target base station, and the target base station receives the response message from the source base station.
de_de: [0292] Schritt 606: Die Quellbasisstation sendet eine Antwortnachricht an die Zielbasisstation, und die Zielbasisstation empfängt die Antwortnachricht von der Quellbasisstation.

source: [0293] Step 606 is an optional step.
de_de: [0293] Schritt 606 ist ein optionaler Schritt.

source: [0294] Step 607: The target base station sends a connection resume rejection message to the terminal, and the terminal receives the connection resume rejection message from the target base station.
de_de: [0294] Schritt 607: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeablehnungsnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeablehnungsnachricht von der Zielbasisstation.

source: [0295] Step 607 is the same as step 404.
de_de: [0295] Schritt 607 ist derselbe wie Schritt 404.

source: [0296] It should be noted that there is no limitation on a sequence between step 607 and step 604 to step 606, that is, step 607 may be performed before step 604, or may be performed after step 606, or may be performed between step 604 and step 606.
de_de: [0296] Es sei angemerkt, dass es keine Einschränkung einer Sequenz zwischen Schritt 607 und Schritt 604 bis Schritt 606 gibt, das heißt, Schritt 607 kann vor Schritt 604 durchgeführt werden oder kann nach Schritt 606 durchgeführt werden oder kann zwischen Schritt 604 und Schritt 606 durchgeführt werden.

source: [0297] According to step 604 to step 607, when the target base station determines to reject the connection resume request of the terminal, in one aspect, the target base station notifies the terminal that the connection resume request is rejected, and in another aspect, the target base station further instructs the source base station to update the context of the terminal, and specifically, update the freshness parameter and the key that are stored in the source base station, so that freshness parameter consistency and key consistency are maintained between the terminal and the source base station.
de_de: [ 0297] Gemäß Schritt 604 bis Schritt 607, wenn die Zielbasisstation bestimmt, die Verbindungswiederaufnahmeanforderung des Endgeräts abzulehnen, benachrichtigt die Zielbasisstation das Endgerät bei einem Aspekt, dass die Verbindungswiederaufnahmeanforderung abgelehnt wird, und bei einem weiteren Aspekt weist die Zielbasisstation ferner die Quellbasisstation an, den Kontext des Endgeräts zu aktualisieren und insbesondere den Aktualitätsparameter und den Schlüssel, die in der Quellbasisstation gespeichert sind, zu aktualisieren, so dass Aktualitätsparameterkonsistenz und Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten werden.

source: [0298] Step 608: The target base station sends a context request message to the source base station, and the source base station receives the context request message from the target base station.
de_de: [0298] Schritt 608: Die Zielbasisstation sendet eine Kontextanforderungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Kontextanforderungsnachricht von der Zielbasisstation.

source: [0299] The context request message includes the message authentication code generated by the terminal, the freshness parameter, and the resume identifier, and the context request message is used to request to obtain the context of the terminal.
de_de: [0299] Die Kontextanforderungsnachricht enthält den durch das Endgerät erzeugten Nachrichtenauthentifizierungscode, den Aktualitätsparameter und die Wiederaufnahmekennung, und die Kontextanforderungsnachricht wird verwendet, um anzufordern, den Kontext des Endgeräts zu erhalten.

source: [0300] Step 609: The source base station updates the freshness parameter and the key that are in the context of the terminal if checking the message authentication code to be successful.
de_de: [0300] Schritt 609: Die Quellbasisstation aktualisiert den Aktualitätsparameter und den Schlüssel, die sich in dem Kontext des Endgeräts befinden, wenn sie prüft, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0301] For a manner in which the source base station checks the message authentication code and a manner in which the source base station updates the freshness parameter and the key that are in the context of the terminal, refer to the description in step 605.
de_de: [0301] Für eine Weise, in der die Quellbasisstation den Nachrichtenauthentifizierungscode prüft, und eine Weise, in der die Quellbasisstation den Aktualitätsparameter und den Schlüssel aktualisiert, die sich im Kontext des Endgeräts befinden, wird auf die Beschreibung in Schritt 605 verwiesen.

source: [0302] Step 610: The source base station sends a context response message to the target base station, and the target base station receives the context response message from the source base station.
de_de: [0302] Schritt 610: Die Quellbasisstation sendet eine Kontextantwortnachricht an die Zielbasisstation, und die Zielbasisstation empfängt die Kontextantwortnachricht von der Quellbasisstation.

source: [0303] Step 611: The target base station sends a connection resume response message to the terminal, and the terminal receives the connection resume response message from the target base station.
de_de: [0303] Schritt 611: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeantwortnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation.

source: [0304] Step 610 and step 611 are the same as step 307 and step 308.
de_de: [0304] Schritt 610 und Schritt 611 sind dieselben wie Schritt 307 und Schritt 308.

source: [0305] According to step 608 to step 611, when the target base station determines to accept the resuming of the connection to the terminal, the source base station checks the message authentication code of the terminal based on the freshness parameter, the integrity protection key of the source base station, and the integrity protection algorithm of the source base station.
de_de: [0305] Gemäß Schritt 608 bis Schritt 611, wenn die Zielbasisstation bestimmt, das Wiederaufnehmen der Verbindung mit dem Endgerät zu akzeptieren, prüft die Quellbasisstation den Nachrichtenauthentifizierungscode des Endgeräts basierend auf dem Aktualitätsparameter, dem Integritätsschutzschlüssel der Quellbasisstation und dem Integritätsschutzalgorithmus der Quellbasisstation.

source: When the check is successful, in one aspect, the source base station updates the freshness parameter in the context of the terminal in the source base station based on the freshness parameter of the terminal and updates the key in the context of the terminal in the source base station, and in another aspect, the source base station sends an obtained context of the terminal to the target base station.
de_de: Wenn die Prüfung erfolgreich ist, aktualisiert die Quellbasisstation bei einem Aspekt den Aktualitätsparameter im Kontext des Endgeräts in der Quellbasisstation basierend auf dem Aktualitätsparameter des Endgeräts und aktualisiert den Schlüssel im Kontext des Endgeräts in der Quellbasisstation, und bei einem weiteren Aspekt sendet die Quellbasisstation einen erhaltenen Kontext des Endgeräts an die Zielbasisstation.

source: [0306] According to the method in step 601 to step 611, the freshness parameter is introduced into an input parameter used by the terminal to generate the message authentication code.
de_de: [0306] Gemäß dem Verfahren in Schritt 601 bis Schritt 611 wird der Aktualitätsparameter in einen Eingabeparameter eingeführt, der von dem Endgerät verwendet wird, um den Nachrichtenauthentifizierungscode zu erzeugen.

source: In addition, the integrity protection key used to generate the message authentication code is generated based on an updated integrity protection key.
de_de: Zusätzlich wird der Integritätsschutzschlüssel, der verwendet wird, um den Nachrichtenauthentifizierungscode zu erzeugen, basierend auf einem aktualisierten Integritätsschutzschlüssel erzeugt.

source: In one aspect, if the target base station rejects the connection resume request of the terminal, the target base station may instruct the source base station to update the freshness parameter and the key that are in the context of the terminal in step 604, so that freshness parameter consistency and key consistency are maintained between the terminal and the source base station.
de_de: Bei einem Aspekt, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, kann die Zielbasisstation die Quellbasisstation anweisen, den Aktualitätsparameter und den Schlüssel, die sich im Kontext des Endgeräts befinden, in Schritt 604 zu aktualisieren, so dass Aktualitätsparameterkonsistenz und Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten werden.

source: In another aspect, if the target base station accepts the connection resume request of the terminal, the target base station may request to obtain the context of the terminal from the source base station in step 608, and the source base station may further update the freshness parameter and the key that are in the context of the terminal in the source base station in this process, so that freshness parameter consistency and key consistency are maintained between the terminal and the source base station.
de_de: bei einem weiteren Aspekt, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts akzeptiert, kann die Zielbasisstation anfordern, den Kontext des Endgeräts von der Quellbasisstation in Schritt 608 zu erhalten, und die Quellbasisstation kann den Aktualitätsparameter und den Schlüssel, die sich im Kontext des Endgeräts befinden, in der Quellbasisstation in diesem Prozess weiter aktualisieren, so dass Aktualitätsparameterkonsistenz und Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten werden.

source: [0307] According to the method in step 601 to step 611, in one aspect, key synchronization can be maintained between the terminal and the source base station, and in another aspect, an attack from an attacker can be effectively resisted.
de_de: [0307] Gemäß dem Verfahren in Schritt 601 bis Schritt 611 kann bei einem Aspekt die Schlüsselsynchronisation zwischen dem Endgerät und der Quellbasisstation aufrechterhalten werden, und bei einem weiteren Aspekt kann einem Angriff von einem Angreifer effektiv entgegengewirkt werden.

source: Therefore, this helps the terminal smoothly enter the connected state from the inactive state.
de_de: Daher hilft dies dem Endgerät, aus dem inaktiven Zustand reibungslos in den verbundenen Zustand einzutreten.

source: [0308] Solution 4
de_de: [0308] Lösung 4

source: [0309] The solution 4 may be used to resolve a problem existing when the manner 2 is used to generate the message authentication code in step 301.
de_de: [0309] Die Lösung 4 kann verwendet werden, um ein bestehendes Problem zu lösen, wenn die Weise 2 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen.

source: [0310] Step 701: A terminal generates a message authentication code.
de_de: [0310] Schritt 701: Ein Endgerät erzeugt einen Nachrichtenauthentifizierungscode.

source: [0311] Step 701 is the same as the manner 2 in step 301.
de_de: [0311] Schritt 701 ist der gleiche wie die Weise 2 in Schritt 301.

source: [0312] In step 701, before generating the message authentication code, the terminal updates an access stratum key, that is, updates KgNB to KgNB*, and further updates an integrity protection key, that is, updates Krrc-int to Krrc-int*.
de_de: [0312] In Schritt 701 aktualisiert das Endgerät vor dem Erzeugen des Nachrichtenauthentifizierungscodes einen Zugriffsschichtschlüssel, d. h. aktualisiert KgNB auf KgNB*, und aktualisiert ferner einen Integritätsschutzschlüssel, d. h. aktualisiert Krrc-int auf Krrc-int*.

source: Then, the terminal generates the message authentication code based on the updated integrity protection key.
de_de: Dann erzeugt das Endgerät den Nachrichtenauthentifizierungscode basierend auf dem aktualisierten Integritätsschutzschlüssel.

source: [0313] Step 702: The terminal sends a connection resume request message to a target base station, and the target base station receives the connection resume request message from the terminal.
de_de: [0313] Schritt 702: Das Endgerät sendet eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, und die Zielbasisstation empfängt die Verbindungswiederaufnahmeanforderungsnachricht von dem Endgerät.

source: [0314] Step 702 is the same as step 302.
de_de: [0314] Schritt 702 ist der gleiche wie Schritt 302.

source: [0315] Step 703: The target base station determines whether to accept the resume request of the terminal.
de_de: [0315] Schritt 703: Die Zielbasisstation bestimmt, ob die Wiederaufnahmeanforderung des Endgeräts akzeptiert werden soll.

source: [0316] The target base station determines, based on a load capability, whether the terminal can access the target base station.
de_de: [0316] Die Zielbasisstation bestimmt basierend auf einer Lastfähigkeit, ob das Endgerät auf die Zielbasisstation zugreifen kann.

source: [0317] In one case, if the target base station has relatively heavy load and cannot be accessed by the terminal, the target base station may reject the resume request of the terminal, that is, reject access by the terminal to the target base station.
de_de: [0317] In einem Fall, wenn die Zielbasisstation eine relativ hohe Last aufweist und auf die das Endgerät nicht zugreifen kann, kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts zurückweisen, das heißt, den Zugriff des Endgeräts auf die Zielbasisstation zurückweisen.

source: In this case, step 704 and step 705 are performed.
de_de: In diesem Fall werden Schritt 704 und Schritt 705 durchgeführt.

source: [0318] In another case, the target base station does not have very heavy load and may further be accessed by the terminal. In this case, the target base station may accept the resume request of the terminal, that is, agree to access by the terminal to the target base station.
de_de: [0318] In einem anderen Fall weist die Zielbasisstation keine sehr hohe Last auf und es kann ferner durch das Endgerät darauf zugegriffen werden. In diesem Fall kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts akzeptieren, das heißt, dem Zugriff durch das Endgerät auf die Zielbasisstation zustimmen.

source: In this case, step 706 to step 709 are performed.
de_de: In diesem Fall werden Schritt 706 bis Schritt 709 durchgeführt.

source: [0319] Step 704: The target base station sends a connection resume rejection message to the terminal, and the terminal receives the connection resume rejection message from the target base station.
de_de: [0319] Schritt 704: Die Zielbasisstation sendet eine Verbindungswiederaufnahme-Ablehnungsnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahme-Ablehnungsnachricht von der Zielbasisstation.

source: [0320] Step 704 is the same as step 304.
de_de: [ 0320] [0320] Schritt 704 ist derselbe wie Schritt 304.

source: [0321] Step 705: The terminal resumes the access stratum key of the terminal to the access stratum key before the update.
de_de: [0321] Schritt 705: Das Endgerät nimmt den Zugriffsschichtschlüssel des Endgeräts vor der Aktualisierung mit dem Zugriffsschichtschlüssel wieder auf.

source: [0322] An implementation may be that before receiving the rejection message, the terminal stores the access stratum key before the update, for example, KgNB.
de_de: [0322] Eine Implementierung kann sein, dass das Endgerät vor dem Empfangen der Ablehnungsnachricht den Zugriffsschichtschlüssel vor der Aktualisierung speichert, zum Beispiel KgNB.

source: After the terminal receives the rejection message, the terminal keeps the access stratum key before the update as a current or stored access stratum key.
de_de: Nachdem das Endgerät die Ablehnungsnachricht empfängt, behält das Endgerät den Zugriffsschichtschlüssel vor der Aktualisierung als einen aktuellen oder gespeicherten Zugriffsschichtschlüssel.

source: Optionally, after receiving the rejection message, the terminal may further delete the updated access stratum key, for example, KgNB*.
de_de: Optional kann das Endgerät nach dem Empfangen der Ablehnungsnachricht ferner den aktualisierten Zugriffsschichtschlüssel löschen, zum Beispiel KgNB*.
